/*
 *      Упражнение 1.7.
 *  Напишите программу, печатающую значение EOF.
 *
 *	Vladimir Kashin
 *	<vova6281527@gmail.com>
 *	26-JAN-2017
 */

#include <stdio.h>

int main(void)
{
    printf("EOF = %d\n", EOF);
    return 0;
}
