/*      Упражнение 1.7.
 *  Напишите программу, печатающую значение EOF. */

#include <stdio.h>

int main(void)
{
    printf("EOF = %d\n", EOF);
    return 0;
}
